{"class_name": "Sequential", "keras_version": "1.1.1", "config": [{"class_name": "Lambda", "config": {"batch_input_shape": [null, 66, 200, 3], "output_shape_type": "raw", "input_dtype": "float32", "trainable": true, "output_shape": [66, 200, 3], "arguments": {}, "function_type": "lambda", "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00faG/users/PAS0947/osu8077/new/udacity/P3-CarND-Behavioral-Cloning/model.py\u00da\b<lambda>\u009f\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "b_regularizer": null, "border_mode": "valid", "subsample": [2, 2], "activity_regularizer": null, "b_constraint": null, "nb_filter": 24, "W_constraint": null, "bias": true, "init": "normal", "trainable": true, "activation": "linear", "nb_col": 5, "dim_ordering": "tf", "name": "conv1_1", "W_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "b_regularizer": null, "border_mode": "valid", "subsample": [2, 2], "activity_regularizer": null, "b_constraint": null, "nb_filter": 36, "W_constraint": null, "bias": true, "init": "normal", "trainable": true, "activation": "linear", "nb_col": 5, "dim_ordering": "tf", "name": "conv2_1", "W_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "b_regularizer": null, "border_mode": "valid", "subsample": [2, 2], "activity_regularizer": null, "b_constraint": null, "nb_filter": 48, "W_constraint": null, "bias": true, "init": "normal", "trainable": true, "activation": "linear", "nb_col": 5, "dim_ordering": "tf", "name": "conv3_1", "W_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "b_regularizer": null, "border_mode": "valid", "subsample": [1, 1], "activity_regularizer": null, "b_constraint": null, "nb_filter": 64, "W_constraint": null, "bias": true, "init": "normal", "trainable": true, "activation": "linear", "nb_col": 3, "dim_ordering": "tf", "name": "conv4_1", "W_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "b_regularizer": null, "border_mode": "valid", "subsample": [1, 1], "activity_regularizer": null, "b_constraint": null, "nb_filter": 64, "W_constraint": null, "bias": true, "init": "normal", "trainable": true, "activation": "linear", "nb_col": 3, "dim_ordering": "tf", "name": "conv4_2", "W_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_5", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "output_dim": 1164, "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "bias": true, "init": "normal", "trainable": true, "activation": "linear", "input_dim": null, "name": "dense_0", "W_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_6", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "output_dim": 100, "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "bias": true, "init": "normal", "trainable": true, "activation": "linear", "input_dim": null, "name": "dense_1", "W_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_7", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "output_dim": 50, "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "bias": true, "init": "normal", "trainable": true, "activation": "linear", "input_dim": null, "name": "dense_2", "W_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_8", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "output_dim": 10, "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "bias": true, "init": "normal", "trainable": true, "activation": "linear", "input_dim": null, "name": "dense_3", "W_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_9", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "output_dim": 1, "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "bias": true, "init": "normal", "trainable": true, "activation": "linear", "input_dim": null, "name": "dense_4", "W_regularizer": null}}]}