{"keras_version": "1.2.0", "config": [{"config": {"arguments": {}, "batch_input_shape": [null, 16, 32, 1], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>S\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32", "function_type": "lambda", "output_shape_type": "raw", "trainable": true, "name": "lambda_1", "output_shape": null}, "class_name": "Lambda"}, {"config": {"subsample": [1, 1], "b_regularizer": null, "name": "convolution2d_1", "W_constraint": null, "dim_ordering": "tf", "border_mode": "valid", "activation": "linear", "activity_regularizer": null, "init": "normal", "nb_filter": 8, "W_regularizer": null, "bias": true, "nb_row": 3, "b_constraint": null, "nb_col": 3, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_1", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"subsample": [1, 1], "b_regularizer": null, "name": "convolution2d_2", "W_constraint": null, "dim_ordering": "tf", "border_mode": "valid", "activation": "linear", "activity_regularizer": null, "init": "normal", "nb_filter": 8, "W_regularizer": null, "bias": true, "nb_row": 3, "b_constraint": null, "nb_col": 3, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_2", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"W_constraint": null, "b_regularizer": null, "activation": "linear", "b_constraint": null, "activity_regularizer": null, "name": "dense_1", "init": "glorot_uniform", "W_regularizer": null, "bias": true, "output_dim": 50, "input_dim": 96, "trainable": true}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"W_constraint": null, "b_regularizer": null, "activation": "linear", "b_constraint": null, "activity_regularizer": null, "name": "dense_2", "init": "glorot_uniform", "W_regularizer": null, "bias": true, "output_dim": 1, "input_dim": 50, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential"}