{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"function_type": "lambda", "batch_input_shape": [null, 66, 200, 3], "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00faG/users/PAS0947/osu8077/new/udacity/P3-CarND-Behavioral-Cloning/model.py\u00da\b<lambda>\u009a\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": [66, 200, 3], "output_shape_type": "raw", "trainable": true, "input_dtype": "float32", "name": "lambda_1"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "b_constraint": null, "init": "normal", "subsample": [2, 2], "W_constraint": null, "bias": true, "trainable": true, "border_mode": "valid", "b_regularizer": null, "activation": "linear", "nb_filter": 24, "nb_row": 5, "nb_col": 5, "W_regularizer": null, "name": "conv1_1", "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "b_constraint": null, "init": "normal", "subsample": [2, 2], "W_constraint": null, "bias": true, "trainable": true, "border_mode": "valid", "b_regularizer": null, "activation": "linear", "nb_filter": 36, "nb_row": 5, "nb_col": 5, "W_regularizer": null, "name": "conv2_1", "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "b_constraint": null, "init": "normal", "subsample": [2, 2], "W_constraint": null, "bias": true, "trainable": true, "border_mode": "valid", "b_regularizer": null, "activation": "linear", "nb_filter": 48, "nb_row": 5, "nb_col": 5, "W_regularizer": null, "name": "conv3_1", "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "b_constraint": null, "init": "normal", "subsample": [1, 1], "W_constraint": null, "bias": true, "trainable": true, "border_mode": "valid", "b_regularizer": null, "activation": "linear", "nb_filter": 64, "nb_row": 3, "nb_col": 3, "W_regularizer": null, "name": "conv4_1", "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "b_constraint": null, "init": "normal", "subsample": [1, 1], "W_constraint": null, "bias": true, "trainable": true, "border_mode": "valid", "b_regularizer": null, "activation": "linear", "nb_filter": 64, "nb_row": 3, "nb_col": 3, "W_regularizer": null, "name": "conv4_2", "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_5"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"output_dim": 1164, "activity_regularizer": null, "b_constraint": null, "init": "normal", "W_constraint": null, "bias": true, "trainable": true, "b_regularizer": null, "activation": "linear", "input_dim": null, "name": "dense_0", "W_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_6"}}, {"class_name": "Dense", "config": {"output_dim": 100, "activity_regularizer": null, "b_constraint": null, "init": "normal", "W_constraint": null, "bias": true, "trainable": true, "b_regularizer": null, "activation": "linear", "input_dim": null, "name": "dense_1", "W_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_7"}}, {"class_name": "Dense", "config": {"output_dim": 50, "activity_regularizer": null, "b_constraint": null, "init": "normal", "W_constraint": null, "bias": true, "trainable": true, "b_regularizer": null, "activation": "linear", "input_dim": null, "name": "dense_2", "W_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_8"}}, {"class_name": "Dense", "config": {"output_dim": 10, "activity_regularizer": null, "b_constraint": null, "init": "normal", "W_constraint": null, "bias": true, "trainable": true, "b_regularizer": null, "activation": "linear", "input_dim": null, "name": "dense_3", "W_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_9"}}, {"class_name": "Dense", "config": {"output_dim": 1, "activity_regularizer": null, "b_constraint": null, "init": "normal", "W_constraint": null, "bias": true, "trainable": true, "b_regularizer": null, "activation": "linear", "input_dim": null, "name": "dense_4", "W_regularizer": null}}], "keras_version": "1.1.1"}